def levenshtein_distance(s1, s2):
    if s1==s2:
        return 0
    dp = [[0]*(s1+1) for _ in range(len(s2)+1)]

    dp[0][0] = 0
  j от 1 до N
   D(0, j) = D(0, j - 1) + цена вставки символа S2[j]
 для всех i от 1 до M
   D(i, 0) = D(i - 1, 0) + цена удаления символа S1[i]
   для всех j от 1 до N
     D(i, j) = min{
       D(i - 1, j) + цена удаления символа S1[i],
       D(i, j - 1) + цена вставки символа S2[j],
       D(i - 1, j - 1) + цена замены символа S1[i] на символ S2[j]
     }
 вернуть D(M, N)